In [2]:
import pandas as pd
d=pd.DataFrame({'StudentName':["adhiraj","Vibhor","Tejas","Ojas","vishal","Yogi","raj","Altamas","Vikash","Abhinav"],
                'Course':['MCA','MSc','MCA','BSc','BTECH','BA','BTECH','MSc','MSc','BSc'],
                'RegistrationNo':[124289,124567,124671,124789,124609,124356,124098,124569,124097,124096]})
d

  StudentName Course  RegistrationNo
0     adhiraj    MCA          124289
1      Vibhor    MSc          124567
2       Tejas    MCA          124671
3        Ojas    BSc          124789
4      vishal  BTECH          124609
5        Yogi     BA          124356
6         raj  BTECH          124098
7     Altamas    MSc          124569
8      Vikash    MSc          124097
9     Abhinav    BSc          124096

In [3]:
d.loc[2:4,"StudentName":"Course"]

  StudentName Course
2       Tejas    MCA
3        Ojas    BSc
4      vishal  BTECH

In [4]:
d.iloc[1:4]

  StudentName Course  RegistrationNo
1      Vibhor    MSc          124567
2       Tejas    MCA          124671
3        Ojas    BSc          124789

In [5]:
d.loc[1:4]

  StudentName Course  RegistrationNo
1      Vibhor    MSc          124567
2       Tejas    MCA          124671
3        Ojas    BSc          124789
4      vishal  BTECH          124609

In [6]:
d.iloc[3:5,0:2]

  StudentName Course
3        Ojas    BSc
4      vishal  BTECH

In [7]:
d.dtypes

StudentName       object
Course            object
RegistrationNo     int64
dtype: object

In [8]:
#d["Age"]=pd.to_numeric(d["Age"]) - to change data types

In [9]:
d[d["RegistrationNo"]>124113]

  StudentName Course  RegistrationNo
0     adhiraj    MCA          124289
1      Vibhor    MSc          124567
2       Tejas    MCA          124671
3        Ojas    BSc          124789
4      vishal  BTECH          124609
5        Yogi     BA          124356
7     Altamas    MSc          124569

In [10]:
d[d["Course"]=="MSc"]

  StudentName Course  RegistrationNo
1      Vibhor    MSc          124567
7     Altamas    MSc          124569
8      Vikash    MSc          124097

In [11]:
d["RegistrationNo"].sum()

1244141

In [12]:
d["Course"].count()

10

In [13]:
d["RegistrationNo"].std()

260.8939546167284

In [14]:
d["RegistrationNo"].var()

68065.65555555555

In [15]:
d["RegistrationNo"].mean()

124414.1

In [16]:
d["RegistrationNo"].median()

124461.5

In [17]:
d["RegistrationNo"].mode()

0    124096
1    124097
2    124098
3    124289
4    124356
5    124567
6    124569
7    124609
8    124671
9    124789
Name: RegistrationNo, dtype: int64

In [18]:
d["Course"].mode()

0    MSc
Name: Course, dtype: object

In [19]:
d["Course"].value_counts()

Course
MSc      3
MCA      2
BSc      2
BTECH    2
BA       1
Name: count, dtype: int64

In [20]:
print(d.describe())
print(d.describe(include='all'))

       RegistrationNo
count       10.000000
mean    124414.100000
std        260.893955
min     124096.000000
25%     124145.750000
50%     124461.500000
75%     124599.000000
max     124789.000000
       StudentName Course  RegistrationNo
count           10     10       10.000000
unique          10      5             NaN
top        adhiraj    MSc             NaN
freq             1      3             NaN
mean           NaN    NaN   124414.100000
std            NaN    NaN      260.893955
min            NaN    NaN   124096.000000
25%            NaN    NaN   124145.750000
50%            NaN    NaN   124461.500000
75%            NaN    NaN   124599.000000
max            NaN    NaN   124789.000000

In [21]:
print(len(d))
print(d.shape)
print(d["Course"].nunique())

print(d["Course"].unique())

10
(10, 3)
5
['MCA' 'MSc' 'BSc' 'BTECH' 'BA']

In [22]:
print(d.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   StudentName     10 non-null     object
 1   Course          10 non-null     object
 2   RegistrationNo  10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes
None

In [23]:
sm=pd.DataFrame(
    {
        "Name":["a","c","d","v","v","r","a"],
        "Maths_Marks":[78,45,69,69,69,58,78]
    }
)
sm

  Name  Maths_Marks
0    a           78
1    c           45
2    d           69
3    v           69
4    v           69
5    r           58
6    a           78

In [24]:
print(sm["Name"].value_counts())
print(sm["Maths_Marks"].value_counts())

Name
a    2
v    2
c    1
d    1
r    1
Name: count, dtype: int64
Maths_Marks
69    3
78    2
45    1
58    1
Name: count, dtype: int64

In [25]:
print("duplicate values :",sm.duplicated().sum())

duplicate values : 2

In [26]:
sm.drop_duplicates()# inplace is used to set how we want to delete permanently(True) or temprarily(False)
sm

  Name  Maths_Marks
0    a           78
1    c           45
2    d           69
3    v           69
4    v           69
5    r           58
6    a           78

In [27]:
print(sm.head(3))
print(sm.head())

  Name  Maths_Marks
0    a           78
1    c           45
2    d           69
  Name  Maths_Marks
0    a           78
1    c           45
2    d           69
3    v           69
4    v           69

In [28]:
print(sm.tail(3))
print(sm.tail())

  Name  Maths_Marks
4    v           69
5    r           58
6    a           78
  Name  Maths_Marks
2    d           69
3    v           69
4    v           69
5    r           58
6    a           78

In [8]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'Key':['K0','K1','K2','K3']})
df1

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [9]:
df2=pd.DataFrame({'C':['C0','C1','C2'],
                  'D':['D0','D1','D2'],
                  'Key':['K0','K1','K2']})
df2

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2

In [10]:
pd.merge(df1,df2,how="right",on="Key")

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [11]:
pd.merge(df1,df2,how="left",on="Key")

    A   B Key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K1   C1   D1
2  A2  B2  K2   C2   D2
3  A3  B3  K3  NaN  NaN

In [12]:
pd.merge(df1,df2,how="inner",on="Key")

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [13]:
pd.merge(df1,df2,how="outer",on="Key")

    A   B Key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K1   C1   D1
2  A2  B2  K2   C2   D2
3  A3  B3  K3  NaN  NaN

In [15]:
pd.merge(df1,df2,how="cross")

     A   B Key_x   C   D Key_y
0   A0  B0    K0  C0  D0    K0
1   A0  B0    K0  C1  D1    K1
2   A0  B0    K0  C2  D2    K2
3   A1  B1    K1  C0  D0    K0
4   A1  B1    K1  C1  D1    K1
5   A1  B1    K1  C2  D2    K2
6   A2  B2    K2  C0  D0    K0
7   A2  B2    K2  C1  D1    K1
8   A2  B2    K2  C2  D2    K2
9   A3  B3    K3  C0  D0    K0
10  A3  B3    K3  C1  D1    K1
11  A3  B3    K3  C2  D2    K2

In [16]:
data=pd.DataFrame({
    'StudentID':[1,2,3,4,5,6,7,8,9,10],
    'Name':['Alice','Bob','Charlie','David','Emma','Frank','Grace','Hank','Ivy','Jack'],
    'Subject':['Math','English','Math','Physics','English','Math','Physics','Math','English','Physics'],
    'Score':[85,78,92,88,75,90,84,95,82,89]
})
data

   StudentID     Name  Subject  Score
0          1    Alice     Math     85
1          2      Bob  English     78
2          3  Charlie     Math     92
3          4    David  Physics     88
4          5     Emma  English     75
5          6    Frank     Math     90
6          7    Grace  Physics     84
7          8     Hank     Math     95
8          9      Ivy  English     82
9         10     Jack  Physics     89

In [17]:
#groupby by subject and calcculating average score
grouped_df=data.groupby('Subject')["Score"].mean().reset_index()
grouped_df

   Subject      Score
0  English  78.333333
1     Math  90.500000
2  Physics  87.000000

In [18]:
print("Max Marks :",data.groupby("Subject")["Score"].max().reset_index())

Max Marks :    Subject  Score
0  English     82
1     Math     95
2  Physics     89

In [19]:
#groupby with multiple coulumns
grouped=data.groupby(['Subject','Score']).sum()
grouped

               StudentID     Name
Subject Score
English 75             5     Emma
        78             2      Bob
        82             9      Ivy
Math    85             1    Alice
        90             6    Frank
        92             3  Charlie
        95             8     Hank
Physics 84             7    Grace
        88             4    David
        89            10     Jack

In [25]:
#groupby with different aggregations
grou=data.groupby('Subject').agg({'Score':['sum','mean','max','min','median']})
grou

        Score
          sum       mean max min median
Subject
English   235  78.333333  82  75   78.0
Math      362  90.500000  95  85   91.0
Physics   261  87.000000  89  84   88.0

In [28]:
grou=data.groupby('Subject').agg({'Score':['sum','mean'],'Subject':'count'})
grou

        Score            Subject
          sum       mean   count
Subject
English   235  78.333333       3
Math      362  90.500000       4
Physics   261  87.000000       3

In [30]:
#groupby and filter groups
gr=data.groupby('Subject').filter(lambda x:x['Score'].mean()>=80)
gr

   StudentID     Name  Subject  Score
0          1    Alice     Math     85
2          3  Charlie     Math     92
3          4    David  Physics     88
5          6    Frank     Math     90
6          7    Grace  Physics     84
7          8     Hank     Math     95
9         10     Jack  Physics     89